Tekla Open API Reference for Tekla Structures 2025
ChangeData.ChangeTypeEnum Enumeration
 The types of changed event.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ChangeTypeEnum
Public Enumeration ChangeTypeEnum
Members
Member name | Value | Description
OBJECT_INSERT | 0 |  Object created
OBJECT_MODIFY | 1 |  Object modified
OBJECT_DELETE | 2 |  Object deleted
USERPROPERTY_CHANGED | 3 |  User property of object changed
See Also
Reference
Tekla.Structures.Model Namespace